app/views/games/_form.html.erb

    <%= f.label :user %><br />
    <%= f.collection_select :user_id, User.all, :id, :name_with_initial, :prompt => true %>
---
SELECT `users`.* FROM `users`