app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `first_name`, `last_name`, `password`, `updated_at`, `username`) VALUES ('2013-04-16 00:35:31', 'colleen', 'noonan', 'cbradio', '2013-04-16 00:35:31', 'cbnoonan')